//
//  Food.swift
//  Food&Drink
//
//  Created by Irina Moiseeva on 24.02.2021.
//

struct Food {
    let menu: [String]
    let cost: [String]
}

extension Food {
    static func getMenu() -> [Food] {
        [
            Food(menu: ["Шашлык", "Ребрышки", "Люля-кебаб", "Колбаски", "Эскалоп", "Куриные крылышки", "Жареный сыр", "Наггетсы", "Кордон блю"], cost: ["Цена: 100р" ,"Цена: 150р", "Цена: 400р", "Цена 300р", "Цена: 250р", "Цена: 250р", "Цена: 250р", "Цена: 250р", "Цена: 250р", "Цена: 250р"]),
            Food(menu: ["Бургер", "Картошка", "Начос", "Коктейль", "Сыр", "Морожение", "Кофе", "Чизкейк", "Торт"], cost: ["Цена: 500р" ,"Цена: 180р", "Цена: 450р", "Цена 300р", "Цена: 253р", "Цена: 257р", "Цена: 250р", "Цена: 230р", "Цена: 450р", "Цена: 270р"]),
            Food(menu: ["Паста", "Розитто", "Пицца", "Запеканка", "Лазанья", "Сыр дор блю", "Прошуто", "Торт", "Фруктовая нарезка"], cost: ["Цена: 500р" ,"Цена: 170р", "Цена: 460р", "Цена 300р", "Цена: 250р", "Цена: 250р", "Цена: 250р", "Цена: 250р", "Цена: 250р", "Цена: 250р"])
        
        ]
    }
}


